<template>
  <section class="mb-20">
    <h1 class="font-bold text-red-600 mb-4">Новости</h1>
    <div class="grid grid-cols-3 sm:grid-cols-2 xs:inline-block gap-6">
      <div v-for="item in paginatedContent" class="xs:mb-8">
        <img class="size-24 mx-auto mb-2" src="@/assets/chakuriki-logo.png">
        <div class="bg-zinc-100 p-4 rounded-lg mb-4">
          <p class="text-xs mb-2">{{item.date}}</p>
          <p class="font-bold">{{item.title}}</p>
        </div>
        <div class="flex justify-center">
          <el-link>Подробнее</el-link>
        </div>
      </div>
    </div>
    <el-paginated :total-pages="Math.ceil(news.length/9)" :current-page="currentPage" @page-changed="onPageChanged" />
  </section>
</template>

<style scoped>

</style>

<script>
export default {
  name: "News",
  data () {
    return {
      currentPage: 1,
      news: [
        {'title': '1Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '2Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '3Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '4sdfsfsdffsds тестовая информация', 'date': '30 мая 2024'},
        {'title': '5Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '6Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '7Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '8Вsdfsdfdsdfsawqтестовая информация', 'date': '30 мая 2024'},
        {'title': '9Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '10Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '11Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '12Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '13Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '14Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': 'LASTВызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '1Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '2Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '3Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '4sdfsfsdffsds тестовая информация', 'date': '30 мая 2024'},
        {'title': '5Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '6Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '7Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '1Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '2Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '3Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '4sdfsfsdffsds тестовая информация', 'date': '30 мая 2024'},
        {'title': '5Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '6Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '7Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '8Вsdfsdfdsdfsawqтестовая информация', 'date': '30 мая 2024'},
        {'title': '9Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '10Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '11Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '12Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '13Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '14Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': 'LASTВызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '1Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '2Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '3Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '4sdfsfsdffsds тестовая информация', 'date': '30 мая 2024'},
        {'title': '5Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '6Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '7Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '1Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '2Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '3Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '4sdfsfsdffsds тестовая информация', 'date': '30 мая 2024'},
        {'title': '5Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '6Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '7Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '8Вsdfsdfdsdfsawqтестовая информация', 'date': '30 мая 2024'},
        {'title': '9Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '10Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '11Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '12Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '13Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '14Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': 'LASTВызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '1Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '2Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '3Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '4sdfsfsdffsds тестовая информация', 'date': '30 мая 2024'},
        {'title': '5Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '6Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},
        {'title': '7Вызов людей в сборную тестовая информация', 'date': '30 мая 2024'},

      ]
    }
  },
  computed: {
    paginatedContent() {
      const start = (this.currentPage - 1)*9;
      const end = start + 9;
      return this.news.slice(start, end);
    },
  },
  methods: {
    onPageChanged(page) {
      this.currentPage = page;
      // Загрузка данных для выбранной страницы
    }
  }
}
</script>
