<template>
  <section class="federation">
    <div class="font-bold text-red-600 text-3xl mb-4">О Федерации</div>
    <section>
      <div class="font-bold text-red-600 text-xl my-4">Целью Федерации является объединение граждан для:</div>
      <ul>
        <li>развития и популяризации стиля «Чакурики», объединяющего кикбоксинг и таиландский бокс;</li>
        <li>укрепления позиций и повышения престижа кикбоксинга и таиландского бокса на всероссийских и международных спортивных аренах;</li>
        <li>удовлетворения профессиональных и любительских интересов спортсменов, тренеров, других специалистов и граждан;</li>
        <li>расширения роли спорта во всестороннем и гармоничном развитии личности, в укреплении здоровья и формировании здорового образа жизни;</li>
        <li>содействия в правовой и социальной защите прав и интересов спортсменов, тренеров и других специалистов, развивающих спортивный стиль «Чакурики».</li>
      </ul>
    </section>
    <section>
      <div class="font-bold text-red-600 text-xl my-4">Задачами Федерации являются:</div>
      <ul>
        <li>повышение роли спорта в жизни общества, формирование здорового образа жизни населения;</li>
        <li>вовлечение широких слоев населения в обучение спортивного стиля «Чакурики»;</li>
        <li>организация подготовки и оказание эффективной помощи спортсменам для участия в соревнованиях разного уровня;</li>
        <li>совершенствование организационно-методических основ подготовки спортивного резерва и высококвалифицированных спортсменов;</li>
        <li>развитие и укрепление связей со спортивными и другими организациями;</li>
        <li>разработка программ развития спортивного стиля «Чакурики»;</li>
        <li>оказание практической, методической и технологической помощи спортсменам в овладении спортивным мастерством.</li>
      </ul>
    </section>
    <section>
      <div class="font-bold text-red-600 text-xl my-4">Задачами Федерации являются:</div>
      <ul>
        <li>повышение роли спорта в жизни общества, формирование здорового образа жизни населения;</li>
        <li>вовлечение широких слоев населения в обучение спортивного стиля «Чакурики»;</li>
        <li>организация подготовки и оказание эффективной помощи спортсменам для участия в соревнованиях разного уровня;</li>
        <li>совершенствование организационно-методических основ подготовки спортивного резерва и высококвалифицированных спортсменов;</li>
        <li>развитие и укрепление связей со спортивными и другими организациями;</li>
        <li>разработка программ развития спортивного стиля «Чакурики»;</li>
        <li>оказание практической, методической и технологической помощи спортсменам в овладении спортивным мастерством.</li>
      </ul>
    </section>
    <section>
      <div class="font-bold text-red-600 text-xl my-4">Для реализации поставленных задач Федерация осуществляет следующие виды деятельности:</div>
      <ul>
        <li>участвует в разработке и реализации целевых, комплексных и учебных программ развития спортивного стиля «Чакурики»;</li>
        <li>принимает участие в организации и проведении соревнований, используя для этого собственные и привлеченные средства;</li>
        <li>взаимодействует и сотрудничает с органами государственного управления физической культурой и спорта г. Москвы, иными государственными и общественными объединениями спортивной и физкультурно-оздоровительной направленности;</li>
        <li>вносит предложения в государственные, муниципальные и общественные организации по различным вопросам общественной жизни общества, в том числе по вопросам развития спорта;</li>
        <li>содействует расширению сети детских спортивных школ, секций, центров, лагерей;</li>
        <li>организует изготовление и сбыт официальной памятной, наградной атрибутики, одежды и другой продукции с символикой Федерации;</li>
        <li>выдвигает своих представителей в руководящие и иные органы спортивных организаций и учреждений, в том числе и всероссийские;</li>
        <li>организует и проводит мероприятия по содействию в повышении квалификации спортсменов;</li>
        <li>организует форумы, семинары, тренинги, мастер-классы, конференции, круглые-столы, фестивали, выставки, конкурсы и иных подобных мероприятий, соответствующих цели деятельности Фонда;</li>
        <li>осуществляет пропаганду спортивного стиля «Чакурики» через средства массовой информации;</li>
        <li>создает спортивные команды, группы, клубы по направлению деятельности Федерации;</li>
        <li>сказывает помощь в подготовке спортсменов, тренеров и судей высокой квалификации, организует подготовку и участие спортсменов и команд в городских, районных, краевых, общероссийских и международных соревнованиях;</li>
        <li>содействует приобретению спортивного оборудования для занятий и проведения спортивных соревнований;</li>
        <li>обеспечивает членов организации научно-технической и иными видами информации, оказывает им правовую и иную консультационную помощь;</li>
        <li>заключает договоры со спортсменами, тренерами, специалистами в области спорта в соответствии с действующим законодательством;</li>
        <li>организует издание методических, спортивно-информационных и других печатных материалов;</li>
        <li>обеспечивает соблюдение членами Федерации, спортсменами, инструкторами, и другими специалистами в области спорта спортивной этики и предпринимает меры по предотвращению применения спортсменами, инструкторами и другими специалистами запрещенных средств и препаратов в спорте;</li>
        <li>поощряет лучших спортсменов, инструкторов, других специалистов, а также членов Федерации;</li>
        <li>осуществляет предпринимательскую и внешнеэкономическую деятельность в соответствии с действующим законодательством для достижения целей, указанных в Уставе.</li>
      </ul>
    </section>
    <section>
      <div class="font-bold text-red-600 text-xl my-4">Руководящий состав</div>
    </section>
    <section>
      <div class="my-4">
        <div>Федерация осуществляет виды деятельности, для ведения которых необходимо наличие лицензии, только после получения лицензии в порядке, установленном законодательством Российской Федерации.</div>
        <div>Предметом деятельности Федерации является совокупность видов ее деятельности, направленных на достижение целей и задач, указанных в настоящем Уставе.</div>
        <el-link class="my-4">Скачать устав</el-link>
      </div>
    </section>
  </section>

</template>

<style scoped>
  .federation ul {
    @apply pl-5
  }
  .federation li{
    @apply list-disc
  }
</style>

<script>
import {defineComponent} from 'vue'
import Navigator from "@/shared/navigator/Navigator.vue";

export default defineComponent({
    name: "Federation",
    components: {Navigator}
})
</script>